# 18147
with open('24_18147.txt') as f:
    s = f.readline()

print(len(s))
print(set(s))
# +8*77**8**+9**7+++9*978897+ # убираю умножение и сплит
# +8, 77, 8, +9, 7+++9, 978897+ # убираю те, где + в начале или конце
# 77, 8, 7+++9 # убираем двойные плюсы и сплитим
# 77, 8, 7, +9 # снова убирает + в начале и в конце
# 77, 8, 7
s = s.replace('++', ' ')
s = s.replace('*', ' ')
s = s.split()

s = [x for x in s if x[0] != '+' and x[-1] != '+'] # универсально
# s = [x.strip('+') for x in s] # умный вариант, но надо убрать пустые строки
s = [eval(x) for x in s]
print(max(s))
   
